<template>
  <div class="export">
    <input type="button" @click="downloadExl" value="导出">
  </div>
</template>

<script>
/**
 * 表头合并单元格以及样式设置 参考文章链接
 * https://www.jianshu.com/p/dfa5c043c5be 
 * https://www.jianshu.com/p/9a465d7d1448
 */
import excel from "@/util/excel.js";
var keyMap = ["日期", "内容", "省份", "市区", "地址", "邮编"]; //通过设置数组让导出时可以按顺序显示
var Data = [
  {
    日期: "2016/5/1",
    内容: "表格内容",
    省份: "上海",
    市区: "普陀区",
    地址: "上海市普陀区金沙江路 1518 弄",
    邮编: "200333"
  },
  {
    日期: "2016/5/2",
    内容: "表格内容",
    省份: "上海",
    市区: "普陀区",
    地址: "上海市普陀区金沙江路 1518 弄",
    邮编: "200333"
  },
  {
    日期: "2016/5/3",
    内容: "表格内容",
    省份: "上海",
    市区: "普陀区",
    地址: "上海市普陀区金沙江路 1518 弄",
    邮编: "200333"
  },
  {
    日期: "2016/5/4",
    内容: "表格内容",
    省份: "上海",
    市区: "普陀区",
    地址: "上海市普陀区金沙江路 1518 弄",
    邮编: "200333"
  },
  {
    日期: "2016/5/5",
    内容: "表格内容",
    省份: "上海",
    市区: "普陀区",
    地址: "上海市普陀区金沙江路 1518 弄",
    邮编: "200333"
  },
  {
    日期: "2016/5/6",
    内容: "表格内容",
    省份: "上海",
    市区: "普陀区",
    地址: "上海市普陀区金沙江路 1518 弄",
    邮编: "200333"
  },
  {
    日期: "2016/5/7",
    内容: "表格内容",
    省份: "上海",
    市区: "普陀区",
    地址: "上海市普陀区金沙江路 1518 弄",
    邮编: "200333"
  }
];
var head = {
  A1: {
    v: "标题",
    t: "s",
    s: {
      font: {
        sz: 18,
        bold: true
      },
      fill: {
        // "bgColor": {
        //   "indexed": 64
        // },
        fgColor: {
          rgb: "FFFF00"
        }
      },
      alignment: {
        horizontal: "center" //设置居中
      }
    }
  },
  B1: {
    v: ""
  },
  C1: {
    v: ""
  },
  D1: {
    v: ""
  },
  E1: {
    v: ""
  },
  F1: {
    v: "邮编"
  },
  A2: {
    v: "日期"
  },
  B2: {
    v: "内容"
  },
  C2: {
    v: "省份"
  },
  D2: {
    v: "市区"
  },
  E2: {
    v: "地址"
  },
  F2: {
    v: "邮编"
  },
  "!merges": [
    {
      //合并表头
      s: { c: 0, r: 0 }, //开始 start 0行 0列
      e: { c: 5, r: 0 } //结束 end   0行 5列
    }
  ],
  "!cols": [
    { wpx: 100 },
    { wpx: 100 },
    { wpx: 50 },
    { wpx: 50 },
    { wpx: 200 },
    { wpx: 100 }
  ] //设置表格每一列宽度
};
export default {
  name: "export",
  data() {
    return {};
  },
  mounted() {},
  methods: {
    downloadExl() {
      excel.exportExcel(Data, "表格名称", head, keyMap, 2);
    }
  }
};
</script>

<style  scoped>
</style>
